function swap(input) {
  let lastIndex = input.length - 1;
  // обхожда първата пловина на масив
  for (let i = 0; i < Math.ceil(input.length / 2); i++) {
    // взимаме стойност на елемент от масива
    // разменяме със стойноста на огледалната позиция в същия масив
    // запазваме стойноста в странична променлива

    let temp = input[i];

    // намираме разтоянието на елемента до симетралата
    //определяме огледалния индекс
    // записваме стойността на огледалния елемент на мястото на текущия

    input[i] = input[lastIndex - i];

    // записваме стоността на външната променлива на мястото на огледалния индекс
    input[lastIndex - i] = temp;
  }

  console.log(input.join(" "));
}

swap(["a", "b", "c", "d", "e"]);

// https://www.youtube.com/watch?v=0akoVC8kL4k
